swt/aufwandsschaetzung.html
---
layout: page
title: Aufwandsschaetzung
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Aufwandsschätzung</h2>
<div class="outline-text-2" id="text-1">
<p>
Methoden zur Aufwandsschätzung sind z.B.:
</p>

<ul class="org-ul">
<li>Schätzung des Aufwands in <i>Lines of Code</i> (LOC)

<ul class="org-ul">
<li>Ermittlung des zeitlichen Aufwands durch Relativierung der
benötigten LOC an der Produktivität eines Mitarbeiters (in LOC pro
Zeitintervall)
</li>
<li>zusätzliche Gewichtung der LOC mit <i>Funktionspunkten</i> möglich
</li>
</ul>
</li>

<li>Analogiemethode: Vergleich mit dem Aufwand ähnlicher, bereits
fertiggestellter Projekte
</li>
</ul>
</div>
</div>
